[
  {
    "title": "mensaDD",
    "description": "mensaDD is an Android app for retrieving the menus of the student canteens in and around Dresden. The main reason for the development was my personal dissatisfaction with the already offered canteen apps. Besides displaying the menu plans, mensaDD also supports the visualisation of all canteens on a map as well as checking the current credit balance of the canteen card. In addition to the app itself, the project includes a server-side crawler that regularly retrieves the offers from the Studentenwerk's website.",
    "url": "https://github.com/julianctni/mensaDD",
    "tags": ["Android", "App", "Java", "Mapbox", "Python"]
  },
  {
    "title": "OUTPUT.DD",
    "description": "OUTPUT.DD is an annual one-day fair of the faculty of computer science at the TU Dresden. The app includes the program, a map view of the event area, an integrated Twitter feed and a gamification component. As part of my master thesis I redesigned the complete UI as well as parts of the game concept. I have continued this work during my work as a research assistant.",
    "url": "https://play.google.com/store/apps/details?id=de.tud.android.outputdd", 
    "tags": ["Android", "App", "Java", "Realm", "Gamification", "Research project"]
  },
  {
    "title": "Dresden Vegan",
    "description": "Dresden Vegan is an Android app where users can quickly find out where they can eat or shop vegan in Dresden. The app includes restaurants, cafés, bakeries, grocery stores and events. These can be displayed in lists or on a map. Dresden Vegan was the first Android app I developed. This was done in cooperation with a friend from university. Unfortunately the app is currently not being developed further due to time constraints.",
    "url": "https://github.com/julianctni/ddvegan",
    "tags": ["Android", "App", "Java", "PHP"]
  },
  {
    "title": "fastVPN",
    "description": "content will be added soon.",
    "tags": ["Web", "Dashboard", "Graphs", "JavaScript", "Materialize CSS", "Cytoscape.js", "node.js", "Websockets"]
  },
  {
    "title": "Verbogene Relationen",
    "description": "content will be added soon.",
    "tags": ["Museum", "Tabletop", "Touch", "D3.js", "JavaScript", "node.js", "Websockets"]
  },
  {
    "title": "Website 50th anniversary of computer science education",
    "description": "content will be added soon.",
    "url": "https://festtage.inf.tu-dresden.de",
    "tags": ["Website", "React", "JavaScript", "Mapbox", "Reactstrap"]
  }
]
